# Todo
# 负责将当前局面在命令行画出来
# 先规定一下Human的命令显示格式，当前动作表如下：
# -----------------------------------
# 000 过牌 001 胡牌
# 弃牌：万 002-010  条 011-019  筒 020-028  字 029-035  +002
# 暗杠：万 036-044  条 045-053  筒 054-062  字 063-069  +036
# 明杠：万 070-078  条 079-087  筒 088-096  字 097-103  +070
# 补牌：万 104-112  条 113-121  筒 122-130  字 131-137  +104
# 碰牌：万 138-146  条 147-155  筒 156-164  字 165-171  +138
# 吃牌：万 172-192  条 193-213  筒 214-234
# 吃牌映射表：
# 万 +0  条 +21  筒 +42
# +00 - +06：[v] v+1 v+2    +00  ->  172: 万二三吃一  173: 万三四吃二 ...
# +07 - +13：v-1 [v] v+1    +07  ->  179: 万一三吃二  180: 万二四吃三 ...
# +14 - +20：v-2 v-1 [v]    +14  ->  186: 万一二吃三  187: 万二三吃四 ...
# -----------------------------------
# 情况如下：
# 统计当前玩家所有可能的动作数量，并且将原先有空缺的动作映射到连续的数字上，例如：
# 当前玩家有以下合法动作：
# 胡牌(001)，弃牌(002, 003, 004)，暗杠(036)，补牌(113)
# 那么我们就将这些动作映射到连续的数字上：
# 胡牌(001)，弃牌(002, 003, 004)，暗杠(005)，补牌(006)
